In [2]:
import pandas as pd
import numpy as np

In [5]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
dicti = {"a":1,"b":2,"c":3,"d":4,"e":5}

In [7]:
seri = pd.Series(dicti)

In [11]:
seri[0:3]

a    1
b    2
c    3
dtype: int64

In [12]:
seri.index = [10,20,30,40,50]

In [13]:
seri

10    1
20    2
30    3
40    4
50    5
dtype: int64

In [14]:
seri.iloc[0:4]

10    1
20    2
30    3
40    4
dtype: int64

In [15]:
seri[0:4]

10    1
20    2
30    3
40    4
dtype: int64

In [16]:
seri + 5

10     6
20     7
30     8
40     9
50    10
dtype: int64

In [17]:
meyve1 =pd.Series([4,3,5,6,1],index=('alma','armud','kivi','banan','zoghal'))

In [18]:
meyve2 =pd.Series([2,1,4,3,7],index=('armud','alma','zoghal','kivi','banan'))

In [19]:
meyve1 + meyve2

alma       5
armud      5
banan     13
kivi       8
zoghal     5
dtype: int64

In [24]:
df = pd.read_csv("C:/Users/Lenovo/Desktop/cities.csv")

In [25]:
df

            Baku
0       Istanbul
1    Los-Angeles
2  San-fransisco
3         Tokiyo
4         Tiblis
5         London
6         Berlin
7           Roma
8          Milan
9         Zurich

In [26]:
len(df)

10

In [27]:
sorted(df)

['Baku']

In [28]:
df

            Baku
0       Istanbul
1    Los-Angeles
2  San-fransisco
3         Tokiyo
4         Tiblis
5         London
6         Berlin
7           Roma
8          Milan
9         Zurich

In [29]:
df

            Baku
0       Istanbul
1    Los-Angeles
2  San-fransisco
3         Tokiyo
4         Tiblis
5         London
6         Berlin
7           Roma
8          Milan
9         Zurich

In [3]:
a = np.random.randint(10,size=5)
b = np.random.randint(10,size=5)
c = np.random.randint(10,size=5)

In [4]:
data = pd.DataFrame({'s1':a,'s2':b,'s3':c})

In [5]:
data

   s1  s2  s3
0   0   8   5
1   0   6   6
2   3   8   5
3   0   2   6
4   5   9   0

In [6]:
a

array([0, 0, 3, 0, 5])

In [9]:
data

   s1  s2  s3
0   0   8   5
1   0   6   6
3   0   2   6
4   5   9   0

In [15]:
data

   s1  s2  s3
0   0   8   5
1   0   6   6
3   0   2   6
4   5   9   0

In [18]:
data.mean().sum()

11.75

In [30]:
ort = (data.sum().sum()) / data.size

In [29]:
ort

3.9166666666666665

In [31]:
data.fillna(value=data.mean().sum())

   s1  s2  s3
0   0   8   5
1   0   6   6
3   0   2   6
4   5   9   0

In [32]:
team_data = pd.DataFrame({"team" : ['galatasaray','fenerbahce','galatasaray','manu','real madrid','barcelaona','liverpool','chelsea'],
                          'salary': [4000,5000,4000,9000,8000,7000,6000,11000]})

In [33]:
team_data

          team  salary
0  galatasaray    4000
1   fenerbahce    5000
2  galatasaray    4000
3         manu    9000
4  real madrid    8000
5   barcelaona    7000
6    liverpool    6000
7      chelsea   11000

In [39]:
group = team_data.groupby('team').sum().loc['galatasaray']

In [40]:
group.mean()

8000.0